; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v7 ?v13)
             (pred_4 ?v11 ?v9)
             (pred_7 ?v7 ?v9)
             (pred_8 ?v8 ?v7 )
	     (pred_6 ?v7)
             (pred_3 ?v3)
             (pred_2 ?v11)
             (pred_5 ?v9)
             (pred_9 ?v7)
             (pred_12 ?v11)
             (pred_10 ?v7)
             (pred_11 ))



(:action op_1
:parameters (?v5 ?v1 ?v6 ?v10)
:precondition (and (pred_3 ?v5) (pred_3 ?v1) (pred_2 ?v6) (pred_5 ?v10)
          (pred_1 ?v5 ?v1) (pred_4 ?v6 ?v10)
                   (pred_7 ?v1 ?v10) (pred_6 ?v5) 
                   (pred_9 ?v1) (pred_12 ?v6))
:effect (and  (pred_10 ?v1) (not (pred_9 ?v1))))


(:action op_3
:parameters (?v5 ?v4)
:precondition (and (pred_3 ?v5) (pred_3 ?v4)
               (pred_6 ?v5) (pred_1 ?v5 ?v4) (pred_10 ?v4))
:effect (and (pred_6 ?v4) (not (pred_6 ?v5))))

(:action op_2
:parameters (?v5 ?v6)
:precondition (and (pred_3 ?v5) (pred_2 ?v6) 
                  (pred_6 ?v5) (pred_8 ?v6 ?v5) (pred_11 ))
:effect (and (pred_12 ?v6)
   (not (pred_8 ?v6 ?v5)) (not (pred_11 ))))


(:action op_4
:parameters (?v5 ?v2 ?v12)
:precondition (and (pred_3 ?v5) (pred_2 ?v2) (pred_2 ?v12)
                  (pred_6 ?v5) (pred_12 ?v12) (pred_8 ?v2 ?v5))
:effect (and (pred_12 ?v2) (pred_8 ?v12 ?v5)
        (not (pred_12 ?v12)) (not (pred_8 ?v2 ?v5))))

(:action op_5
:parameters (?v5 ?v6)
:precondition (and (pred_3 ?v5) (pred_2 ?v6) 
                  (pred_6 ?v5) (pred_12 ?v6))
:effect (and (pred_11 ) (pred_8 ?v6 ?v5) (not (pred_12 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_02 obj_04 obj_20 obj_15 obj_05 obj_08 obj_18 obj_03 obj_07 obj_13 obj_16 obj_17 obj_10 obj_06 obj_11
    obj_01 obj_12
    obj_09 obj_14
    )

    (:init
       (pred_11)

       (pred_3 obj_19)
       (pred_3 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_20)
       (pred_3 obj_15)
       (pred_3 obj_05)
       (pred_3 obj_08)
       (pred_3 obj_18)
       (pred_3 obj_03)
       (pred_3 obj_07)
       (pred_3 obj_13)
       (pred_3 obj_16)
       (pred_3 obj_17)
       (pred_3 obj_10)
       (pred_3 obj_06)
       (pred_3 obj_11)
       (pred_5 obj_01)
       (pred_5 obj_12)
       (pred_2 obj_09)
       (pred_2 obj_14)

       (pred_1 obj_19 obj_15)
       (pred_1 obj_19 obj_02)
       (pred_1 obj_02 obj_05)
       (pred_1 obj_02 obj_04)
       (pred_1 obj_02 obj_19)
       (pred_1 obj_04 obj_08)
       (pred_1 obj_04 obj_20)
       (pred_1 obj_04 obj_02)
       (pred_1 obj_20 obj_18)
       (pred_1 obj_20 obj_04)
       (pred_1 obj_15 obj_03)
       (pred_1 obj_15 obj_05)
       (pred_1 obj_15 obj_19)
       (pred_1 obj_05 obj_07)
       (pred_1 obj_05 obj_08)
       (pred_1 obj_05 obj_02)
       (pred_1 obj_05 obj_15)
       (pred_1 obj_08 obj_13)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_08 obj_04)
       (pred_1 obj_08 obj_05)
       (pred_1 obj_18 obj_16)
       (pred_1 obj_18 obj_20)
       (pred_1 obj_18 obj_08)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_03 obj_15)
       (pred_1 obj_07 obj_10)
       (pred_1 obj_07 obj_13)
       (pred_1 obj_07 obj_05)
       (pred_1 obj_07 obj_03)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_13 obj_16)
       (pred_1 obj_13 obj_08)
       (pred_1 obj_13 obj_07)
       (pred_1 obj_16 obj_11)
       (pred_1 obj_16 obj_18)
       (pred_1 obj_16 obj_13)
       (pred_1 obj_17 obj_10)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_10 obj_06)
       (pred_1 obj_10 obj_07)
       (pred_1 obj_10 obj_17)
       (pred_1 obj_06 obj_11)
       (pred_1 obj_06 obj_13)
       (pred_1 obj_06 obj_10)
       (pred_1 obj_11 obj_16)
       (pred_1 obj_11 obj_06)
       (pred_9 obj_05)
       (pred_9 obj_13)
       (pred_7  obj_05 obj_01)
       (pred_7  obj_13 obj_12)
       (pred_10 obj_19)
       (pred_10 obj_02)
       (pred_10 obj_04)
       (pred_10 obj_20)
       (pred_10 obj_15)
       (pred_10 obj_08)
       (pred_10 obj_18)
       (pred_10 obj_03)
       (pred_10 obj_07)
       (pred_10 obj_16)
       (pred_10 obj_17)
       (pred_10 obj_10)
       (pred_10 obj_06)
       (pred_10 obj_11)

       (pred_4  obj_09 obj_01)
       (pred_4  obj_14 obj_12)
       (pred_8 obj_09 obj_17)
       (pred_8 obj_14 obj_10)
       (pred_6 obj_11)
    )

    (:goal (and
       (pred_8 obj_14 obj_15)
    ))
(:constraints
  (always (not (pred_6 obj_07)))
)
)

; plan
1. (op_3 obj_11 obj_06)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_06)
   goals met: 0 of 1
2. (op_3 obj_06 obj_10)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_10)
   goals met: 0 of 1
3. (op_2 obj_10 obj_14)
   deleted: (pred_8 obj_14 obj_10) (pred_11)
   added: (pred_12 obj_14)
   goals met: 0 of 1
4. (op_3 obj_10 obj_17)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_17)
   goals met: 0 of 1
5. (op_3 obj_17 obj_03)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_03)
   goals met: 0 of 1
6. (op_3 obj_03 obj_15)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_15)
   goals met: 0 of 1
7. (op_5 obj_15 obj_14)
   deleted: (pred_12 obj_14)
   added: (pred_11) (pred_8 obj_14 obj_15)
   goals met: 1 of 1
